In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv("train.csv")
test=pd.read_csv("test.csv")
test_ids=test["PassengerId"]

In [3]:
df1=pd.read_csv("train.csv")

In [4]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
test.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
cols=["PassengerId","Ticket","Cabin","Name","Embarked"]
for i in cols:
    df=df.drop(columns=[i])
    test=test.drop(columns=[i])

In [7]:
cols_1=["Age","Parch","Fare","SibSp"]
for j in cols_1:
    df[j].fillna(df[j].median(), inplace=True)
    test[j].fillna(test[j].median(), inplace=True)

In [8]:
from sklearn import preprocessing
le=preprocessing.LabelEncoder()

In [9]:
df.Sex=le.fit_transform(df.Sex)
test.Sex=le.fit_transform(test.Sex)

In [10]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()

In [11]:
y=df.Survived

In [12]:
X=df.drop(columns=["Survived"])

In [13]:
from sklearn.model_selection import train_test_split

In [14]:
X_train,x_test,y_train,y_test=train_test_split(X,y,test_size=0.1,random_state=42)

In [15]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()

In [16]:
X_train=scaler.fit_transform(X_train)
x_test=scaler.transform(x_test)

In [17]:
from sklearn.linear_model import LogisticRegression

In [18]:
clf=LogisticRegression(random_state=42).fit(X_train,y_train)

In [19]:
predictions=clf.predict(x_test)

In [20]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test, predictions)

0.8444444444444444

In [21]:
test=scaler.transform(test)

In [22]:
pred1=clf.predict(test)

In [23]:
df=pd.DataFrame({"PassengerId": test_ids.values,
                 "Survived": pred1, 
                })

In [26]:
df.to_csv("submission.csv", index=False)